Bwooce/tinygs_nRF52/src/main.cpp
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <malloc.h>  /* picolibc mallinfo() for STATUS log pmem tracking */
#include <stdarg.h>  /* va_list for early_log_appendf */
#include <zephyr/net/openthread.h>
#include <zephyr/net/mqtt.h>
#include <zephyr/net/socket.h>
#include <zephyr/net/tls_credentials.h>
#include <openthread/thread.h>
#include <openthread/error.h>
#include <openthread/netdata.h>
#include <openthread/ip6.h>
#include <openthread/dataset.h>
#include <openthread/dataset_ftd.h>
#include <openthread/dns_client.h>
#include <openthread/joiner.h>
#include <openthread/link.h>

#include <zephyr/usb/usb_device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/uart/cdc_acm.h>
#include <zephyr/fs/fs.h>
#include <ff.h>
#include <zephyr/storage/disk_access.h>

#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/spi.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/dt-bindings/adc/nrf-adc.h>
#include <zephyr/dt-bindings/adc/nrf-saadc.h>  /* NRF_SAADC_AIN2 — DT channel index */
#include <zephyr/sys/base64.h>
#include <zephyr/drivers/watchdog.h>
#if defined(CONFIG_LED_STRIP)
#include <zephyr/drivers/led_strip.h>
#endif
#include <openthread/sntp.h>
#include <time.h>
#include "tinygs_display.h"
#include <zephyr/drivers/hwinfo.h>
#include <hal/nrf_power.h>
#include <hal/nrf_ficr.h>

#include <mbedtls/debug.h>
#include <RadioLib.h>
#include "hal/Zephyr/ZephyrHal.h"
#include "tinygs_protocol.h"
#include "tinygs_json.h"
#include "tinygs_config.h"
#include "bitcode.h"
#if defined(CONFIG_IOT_LOG)
#include <iot_log_zephyr.h>
#endif

LOG_MODULE_REGISTER(tinygs_nrf52, LOG_LEVEL_DBG);

/* Translate common negative errno values to symbolic names. Values
 * match Zephyr minimal libc errno.h, which differs from POSIX above
 * 100. Falls back to "?" so %s is safe. Declared extern "C" in
 * tinygs_protocol.h so other TUs can call it. */
extern "C" const char *errno_name(int err)
{
    switch (err < 0 ? -err : err) {
    case 0:   return "OK";
    case 5:   return "EIO";
    case 11:  return "EAGAIN";
    case 12:  return "ENOMEM";
    case 22:  return "EINVAL";
    case 61:  return "ENODATA";
    case 104: return "ECONNRESET";
    case 105: return "ENOBUFS";
    case 110: return "ESHUTDOWN";
    case 111: return "ECONNREFUSED";
    case 113: return "ECONNABORTED";
    case 114: return "ENETUNREACH";
    case 115: return "ENETDOWN";
    case 116: return "ETIMEDOUT";
    case 117: return "EHOSTDOWN";
    case 118: return "EHOSTUNREACH";
    case 119: return "EINPROGRESS";
    case 128: return "ENOTCONN";
    case 134: return "ENOTSUP";
    case 140: return "ECANCELED";
    default:  return "?";
    }
}

/* RadioLib status/error codes (from lib/RadioLib/src/TypeDef.h). Covers
 * only the codes we realistically see on SX1262 LoRa/FSK begin and RX
 * paths — adding everything would be ~70 entries and most aren't
 * reachable on this chip. */
static const char *radio_err_name(int err)
{
    switch (err) {
    case 0:    return "OK";
    case -1:   return "UNKNOWN";
    case -2:   return "CHIP_NOT_FOUND";
    case -3:   return "MEMORY_ALLOCATION_FAILED";
    case -4:   return "PACKET_TOO_LONG";
    case -5:   return "TX_TIMEOUT";
    case -6:   return "RX_TIMEOUT";
    case -7:   return "CRC_MISMATCH";
    case -8:   return "INVALID_BANDWIDTH";
    case -9:   return "INVALID_SPREADING_FACTOR";
    case -10:  return "INVALID_CODING_RATE";
    case -12:  return "INVALID_FREQUENCY";
    case -13:  return "INVALID_OUTPUT_POWER";
    case -16:  return "SPI_WRITE_FAILED";
    case -17:  return "INVALID_CURRENT_LIMIT";
    case -18:  return "INVALID_PREAMBLE_LENGTH";
    case -19:  return "INVALID_GAIN";
    case -20:  return "WRONG_MODEM";
    case -24:  return "LORA_HEADER_DAMAGED";
    case -25:  return "UNSUPPORTED";
    case -28:  return "NULL_POINTER";
    case -30:  return "PACKET_TOO_SHORT";
    case -101: return "INVALID_BIT_RATE";
    case -102: return "INVALID_FREQUENCY_DEVIATION";
    case -103: return "INVALID_BIT_RATE_BW_RATIO";
    case -104: return "INVALID_RX_BANDWIDTH";
    case -105: return "INVALID_SYNC_WORD";
    case -106: return "INVALID_DATA_SHAPING";
    case -107: return "INVALID_MODULATION";
    case -701: return "INVALID_CRC_CONFIGURATION";
    case -703: return "INVALID_TCXO_VOLTAGE";
    case -704: return "INVALID_MODULATION_PARAMETERS";
    case -705: return "SPI_CMD_TIMEOUT";
    case -706: return "SPI_CMD_INVALID";
    case -707: return "SPI_CMD_FAILED";
    default:   return "?";
    }
}

/* Forward declarations for radio RX */
static void lora_rx_callback(void);
static volatile bool lora_packet_received = false;

/* Crash diagnostic — __noinit survives warm reset (SREQ doesn't clear RAM) */
#define CRASH_MAGIC 0xDEAD0000
static volatile uint32_t __noinit crash_reason;
static volatile uint32_t __noinit crash_pc;
static volatile uint32_t __noinit crash_lr;
static volatile uint32_t __noinit crash_icsr;  /* SCB->ICSR — VECTACTIVE identifies the IRQ */
static volatile uint32_t __noinit crash_thread_ptr; /* raw k_current_get() for post-mortem decode */
static char __noinit crash_thread[16];

/* nRF52840 SRAM covers 0x20000000 – 0x2003FFFF (256 KB). Any pointer used
 * in the fault handler is sanity-checked against this range before we
 * dereference, so a corrupt thread struct or runaway pointer won't double-
 * fault us inside the handler and prevent __noinit diagnostics from landing. */
#define IN_SRAM(p) ((uintptr_t)(p) >= 0x20000000u && (uintptr_t)(p) < 0x20040000u)

/* v3.3: openthread_context.instance is no longer populated by the L2 layer.
 * Use the new singleton accessor via this forward declaration (defined in
 * the openthread module's internal header which we don't pull in directly). */
extern "C" struct otInstance *openthread_get_default_instance(void);

/* z_arch_esf_t was renamed to arch_esf in Zephyr v3.x. */
extern "C" void k_sys_fatal_error_handler(unsigned int reason,
                                           const struct arch_esf *esf)
{
    crash_reason = CRASH_MAGIC | (reason & 0xFFFF);
    crash_icsr = *(volatile uint32_t *)0xE000ED04; /* SCB->ICSR */
    if (esf) {
        crash_pc = esf->basic.pc;
        crash_lr = esf->basic.lr;
    }

    /* Thread pointer is always safe to record — k_current_get() just reads
     * a kernel global, no dereference. A raw pointer is human-decodable
     * against the map file, which is enough to identify the thread even
     * if the name string can't be captured. */
    void *tp = k_current_get();
    crash_thread_ptr = (uint32_t)(uintptr_t)tp;

    /* Name capture is best-effort. If the initial fault was a stack smash
     * that corrupted the thread struct or kernel globals, dereferencing
     * through k_thread_name_get() would fault again inside this handler
     * (the Cortex-M hard-fault-in-handler → lockup path) and the watchdog
     * would have to recover us without any diagnostic. Range-check the
     * pointer first and bail out of the strncpy if anything looks off. */
    crash_thread[0] = '\0';
    if (IN_SRAM(tp)) {
        const char *tname = k_thread_name_get((struct k_thread *)tp);
        if (IN_SRAM(tname)) {
            /* Inline copy with an explicit per-char SRAM guard on the
             * source — if the name string itself points into bad memory,
             * we stop at the first byte we can't safely read rather than
             * running strncpy all the way. */
            size_t i;
            for (i = 0; i < sizeof(crash_thread) - 1; i++) {
                if (!IN_SRAM(tname + i)) break;
                char c = tname[i];
                if (c == '\0') break;
                crash_thread[i] = c;
            }
            crash_thread[i] = '\0';
        }
    }

    sys_reboot(SYS_REBOOT_COLD);
}

