Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* 1200 Baud Reset (UF2 Bootloader Entry)                                     */
/* -------------------------------------------------------------------------- */

static void baudrate_reset_handler(const struct device *dev, uint32_t baudrate)
{
    if (baudrate == 1200) {
        /* No logging here — USB IRQ context, logging to USB would deadlock */
        nrf_power_gpregret_set(NRF_POWER, 0, 0x57);
        sys_reboot(SYS_REBOOT_COLD);
    }
}

/* -------------------------------------------------------------------------- */
/* OpenThread                                                                  */
/* -------------------------------------------------------------------------- */

static const char *ot_role_str(otDeviceRole role)
{
    switch (role) {
    case OT_DEVICE_ROLE_DISABLED: return "Disabled";
    case OT_DEVICE_ROLE_DETACHED: return "Detached";
    case OT_DEVICE_ROLE_CHILD:    return "Child";
    case OT_DEVICE_ROLE_ROUTER:   return "Router";
    case OT_DEVICE_ROLE_LEADER:   return "Leader";
    default:                      return "Unknown";
    }
}

static void ot_state_changed_handler(otChangedFlags flags,
                                     struct openthread_context *ot_context,
                                     void *user_data)
{
    if (flags & OT_CHANGED_THREAD_ROLE) {
        static otDeviceRole prev_role = OT_DEVICE_ROLE_DISABLED;
        static int64_t detached_at_ms = 0;
        otDeviceRole role = otThreadGetDeviceRole(openthread_get_default_instance());

        bool was_attached = (prev_role == OT_DEVICE_ROLE_CHILD ||
                             prev_role == OT_DEVICE_ROLE_ROUTER ||
                             prev_role == OT_DEVICE_ROLE_LEADER);
        bool now_attached = (role == OT_DEVICE_ROLE_CHILD ||
                             role == OT_DEVICE_ROLE_ROUTER ||
                             role == OT_DEVICE_ROLE_LEADER);

        if (!was_attached && now_attached && detached_at_ms != 0) {
            int32_t detached_s = (int32_t)((k_uptime_get() - detached_at_ms) / 1000);
            LOG_WRN("Thread re-attached as %s after %ds detached",
                    ot_role_str(role), detached_s);
            detached_at_ms = 0;
        } else if (was_attached && !now_attached) {
            detached_at_ms = k_uptime_get();
            LOG_WRN("Thread parent lost (role: %s)", ot_role_str(role));
        } else {
            LOG_INF("Thread role: %s", ot_role_str(role));
        }

        thread_attached = now_attached;
        prev_role = role;
    }
}

static struct openthread_state_changed_cb ot_state_cb = {
    .state_changed_cb = ot_state_changed_handler,
};

static void dump_ot_dataset(struct openthread_context *ctx)
{
    otOperationalDataset dataset;
    otError err = otDatasetGetActive(openthread_get_default_instance(), &dataset);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("Failed to get active dataset: %d (%s)",
                (int)err, otThreadErrorToString(err));
        return;
    }

    LOG_INF("Active Dataset:");
    if (dataset.mComponents.mIsChannelPresent) {
        LOG_INF("  Channel: %u", dataset.mChannel);
    }
    if (dataset.mComponents.mIsPanIdPresent) {
        LOG_INF("  PAN ID: 0x%04x", dataset.mPanId);
    }
    if (dataset.mComponents.mIsExtendedPanIdPresent) {
        LOG_HEXDUMP_INF(dataset.mExtendedPanId.m8, 8, "  Ext PAN ID:");
    }
    if (dataset.mComponents.mIsNetworkKeyPresent) {
        LOG_HEXDUMP_INF(dataset.mNetworkKey.m8, 16, "  Network Key:");
    }
    if (dataset.mComponents.mIsNetworkNamePresent) {
        LOG_INF("  Network Name: %s", dataset.mNetworkName.m8);
    }
}

static void dump_ot_state(struct openthread_context *ctx)
{
    otInstance *inst = openthread_get_default_instance();

    LOG_INF("Thread state:");
    LOG_INF("  Role: %s", ot_role_str(otThreadGetDeviceRole(inst)));
    LOG_INF("  Interface up: %s", otIp6IsEnabled(inst) ? "yes" : "no");
    LOG_INF("  Thread enabled: %s", otThreadGetDeviceRole(inst) != OT_DEVICE_ROLE_DISABLED ? "yes" : "no");
    LOG_INF("  Channel: %u", otLinkGetChannel(inst));
    LOG_INF("  PAN ID: 0x%04x", otLinkGetPanId(inst));

    const otExtAddress *ext = otLinkGetExtendedAddress(inst);
    if (ext) {
        LOG_HEXDUMP_INF(ext->m8, 8, "  EUI-64:");
    }

    /* Print all unicast addresses */
    const otNetifAddress *addr = otIp6GetUnicastAddresses(inst);
    while (addr) {
        char buf[OT_IP6_ADDRESS_STRING_SIZE];
        otIp6AddressToString(&addr->mAddress, buf, sizeof(buf));
        LOG_INF("  IPv6 addr: %s", buf);
        addr = addr->mNext;
    }
}

static void log_ot_diagnostics(void)
{
    struct openthread_context *ctx = openthread_get_default_context();
    if (!ctx) {
        LOG_WRN("OT diagnostics: NULL context, skipping");
        return;
    }
    openthread_api_mutex_lock(ctx);
    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

static void joiner_callback(otError error, void *context)
{
    if (error == OT_ERROR_NONE) {
        LOG_INF("=== Joiner succeeded! Starting Thread... ===");
        struct openthread_context *ctx = openthread_get_default_context();
        if (!ctx || !openthread_get_default_instance()) {
            LOG_ERR("Joiner callback: NULL OT context/instance — cannot start Thread.");
            return;
        }
        otIp6SetEnabled(openthread_get_default_instance(), true);
        otThreadSetEnabled(openthread_get_default_instance(), true);
    } else {
        LOG_ERR("Joiner failed: %d (%s)", (int)error, otThreadErrorToString(error));
    }
}

static void init_openthread(void)
{
    struct openthread_context *ctx = openthread_get_default_context();
    if (!ctx) {
        LOG_ERR("OpenThread context is NULL — net stack not initialised? Aborting OT init.");
        return;
    }

    /* v3.3 the L2 layer no longer populates openthread_context.instance;
     * the singleton instance comes from openthread_get_default_instance().
     * Pre-flight check that it's available before we start. */
    if (!openthread_get_default_instance()) {
        LOG_ERR("openthread_get_default_instance() returned NULL — OT not initialised yet.");
        return;
    }

    LOG_INF("Starting OpenThread (Joiner mode)...");
    openthread_state_changed_cb_register(ctx, &ot_state_cb);
    openthread_start(ctx);

    k_msleep(500);

    openthread_api_mutex_lock(ctx);
    otInstance *inst = openthread_get_default_instance();
    if (!inst) {
        LOG_ERR("OpenThread instance is NULL after openthread_start — bailing.");
        openthread_api_mutex_unlock(ctx);
        return;
    }

    /* Check if we already have a valid dataset (from a previous successful join) */
    otOperationalDataset dataset;
    otError err = otDatasetGetActive(inst, &dataset);

    if (err == OT_ERROR_NONE && dataset.mComponents.mIsNetworkKeyPresent) {
        LOG_INF("Found existing dataset — attaching directly");
        dump_ot_dataset(ctx);
        otIp6SetEnabled(inst, true);
        otThreadSetEnabled(inst, true);
    } else {
        LOG_INF("No valid dataset — starting Joiner with PSKd");
        otIp6SetEnabled(inst, true);

        err = otJoinerStart(inst,
                            CONFIG_OPENTHREAD_JOINER_PSKD,  /* PSKd */
                            NULL,   /* provisioning URL */
                            NULL,   /* vendor name */
                            NULL,   /* vendor model */
                            NULL,   /* vendor sw version */
                            NULL,   /* vendor data */
                            joiner_callback, NULL);

