Bwooce/tinygs_nRF52/src/main.cpp
        if (err != OT_ERROR_NONE) {
            LOG_ERR("otJoinerStart failed: %d (%s)", (int)err, otThreadErrorToString(err));
        } else {
            LOG_INF("Joiner started, waiting for commissioner (PSKd: %s)...",
                    CONFIG_OPENTHREAD_JOINER_PSKD);
        }
    }

    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

/* Build a NAT64-synthesised IPv6 peer from the mesh's favored NAT64
 * prefix (read live from Thread netdata) and a caller-supplied IPv4
 * literal. Returns true and fills *out on success; false if no NAT64
 * route is present. Used by both the DNS and SNTP sync paths to avoid
 * ULA→global egress, which OT BorderRouting ICMP-rejects. */
static bool nat64_synth(otInstance *instance, const uint8_t ipv4[4],
                        otIp6Address *out)
{
    otNetworkDataIterator it = OT_NETWORK_DATA_ITERATOR_INIT;
    otExternalRouteConfig route;
    while (otNetDataGetNextRoute(instance, &it, &route) == OT_ERROR_NONE) {
        if (route.mNat64 && route.mPrefix.mLength == 96) {
            *out = route.mPrefix.mPrefix;
            memcpy(&out->mFields.m8[12], ipv4, 4);
            return true;
        }
    }
    return false;
}

/* -------------------------------------------------------------------------- */
/* DNS Resolution via OpenThread DNS client (NAT64)                            */
/* -------------------------------------------------------------------------- */

static K_SEM_DEFINE(dns_sem, 0, 1);
static volatile int dns_result = -1;
/* Serialises resolve_ipv4_hostname() — main thread (MQTT reconnect) and
 * system workqueue (daily SNTP resync) can both call it. Without this,
 * the second caller's k_sem_reset() corrupts the first's wait, and the
 * dns_callback writes whichever dns_ctx* arrived second into the wrong
 * caller's *out. Hold time = single DNS round-trip, ≤15 s. */
static K_MUTEX_DEFINE(dns_mutex);

/* Shared resolver-callback context. Stack allocation is unsafe because
 * the query can timeout in k_sem_take, leaving the OT stack with a pointer
 * to a destroyed stack frame. Using a static struct protected by dns_mutex,
 * plus a query generation ID, prevents use-after-free and cross-talk
 * (a late callback from a timed-out query unblocking a new query). */
struct dns_ctx {
    otIp6Address *out;
    const char  *hostname;
};
static struct dns_ctx current_dctx;
static uint32_t current_dns_id = 0;

static void dns_callback(otError aError, const otDnsAddressResponse *aResponse, void *aContext)
{
    uint32_t id = (uint32_t)(uintptr_t)aContext;
    if (id != current_dns_id) {
        LOG_WRN("Ignoring late DNS callback for ID %u (current %u)", id, current_dns_id);
        return;
    }

    if (aError != OT_ERROR_NONE) {
        LOG_ERR("OT DNS callback error: %d (%s)", (int)aError, otThreadErrorToString(aError));
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    otIp6Address addr;
    uint32_t ttl;
    otError err = otDnsAddressResponseGetAddress(aResponse, 0, &addr, &ttl);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("OT DNS no address in response: %d (%s)", (int)err, otThreadErrorToString(err));
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    if (current_dctx.out) {
        *current_dctx.out = addr;
    }

    char addr_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&addr, addr_str, sizeof(addr_str));
    LOG_INF("Resolved %s -> [%s] (TTL=%u)",
            current_dctx.hostname ? current_dctx.hostname : "?", addr_str, (unsigned)ttl);

    dns_result = 0;
    k_sem_give(&dns_sem);
}

/* Generic hostname → NAT64-synthesised IPv6 resolver. Used by the MQTT
 * broker and SNTP paths — anywhere we need to reach an IPv4-only host
 * from the Thread mesh. Returns 0 on success and fills *out; -1 on any
 * failure. Blocks up to 15 s waiting on the DNS callback. */
static int resolve_ipv4_hostname(const char *hostname, otIp6Address *out)
{
    struct openthread_context *ctx = openthread_get_default_context();

    /* Lock for the whole resolve so dns_sem / dns_result / dns_callback
     * can't be co-opted by an overlapping caller. Hold ≤15 s. */
    k_mutex_lock(&dns_mutex, K_FOREVER);

    k_sem_reset(&dns_sem);
    dns_result = -1;
    current_dns_id++;
    current_dctx.out = out;
    current_dctx.hostname = hostname;

    otDnsQueryConfig config;
    memset(&config, 0, sizeof(config));
    static const uint8_t dns_v4[4] = TINYGS_DNS_SERVER_V4;
    openthread_api_mutex_lock(ctx);
    bool found = nat64_synth(openthread_get_default_instance(), dns_v4, &config.mServerSockAddr.mAddress);
    openthread_api_mutex_unlock(ctx);
    if (!found) {
        LOG_ERR("No /96 NAT64 route in Thread netdata — mesh has no NAT64 translator?");
        k_mutex_unlock(&dns_mutex);
        return -1;
    }
    config.mServerSockAddr.mPort    = TINYGS_DNS_SERVER_PORT;
    config.mResponseTimeout         = 10000;
    config.mMaxTxAttempts           = 3;
    config.mRecursionFlag           = OT_DNS_FLAG_RECURSION_DESIRED;
    config.mNat64Mode               = OT_DNS_NAT64_ALLOW;

    char dns_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&config.mServerSockAddr.mAddress, dns_str, sizeof(dns_str));
    LOG_INF("Resolving %s via NAT64-synthesised DNS [%s]:53",
            hostname, dns_str);

    /* Query A record (IPv4) explicitly. IPv4-only hosts return NotFound
     * for AAAA queries. With mNat64Mode=ALLOW and a NAT64 prefix in
     * netdata, OT synthesises an AAAA from the A response — we get back
     * a NAT64-prefixed address directly usable as a peer. */
    openthread_api_mutex_lock(ctx);
    otError err = otDnsClientResolveIp4Address(openthread_get_default_instance(),
                                               hostname,
                                               dns_callback, (void *)(uintptr_t)current_dns_id,
                                               &config);
    openthread_api_mutex_unlock(ctx);

    if (err != OT_ERROR_NONE) {
        LOG_ERR("otDnsClientResolveAddress failed: %d (%s)",
                (int)err, otThreadErrorToString(err));
        goto out_invalidate;
    }

    /* Wait for callback (up to 15s) */
    if (k_sem_take(&dns_sem, K_SECONDS(15)) != 0) {
        LOG_ERR("DNS resolution timed out");
        goto out_invalidate;
    }

    {
        int ret = dns_result;
        /* Invalidate the context on success too — covers the rare case
         * where OT fires a duplicate callback after the first one we
         * accepted (we'd already have the answer; second one would write
         * to the same out pointer harmlessly, but we're being strict). */
        current_dns_id++;
        current_dctx.out = NULL;
        k_mutex_unlock(&dns_mutex);
        return ret;
    }

out_invalidate:
    /* Bump generation + clear out pointer so any straggling OT callback
     * (OT can keep retrying for ~30 s after our 15 s wait) drops itself
     * via the ID mismatch in dns_callback, AND can't dereference a stale
     * caller-side `out` pointer even if it slips past the ID check
     * window. Belt-and-braces. */
    current_dns_id++;
    current_dctx.out = NULL;
    k_mutex_unlock(&dns_mutex);
    return -1;
}

/* Resolve the MQTT broker hostname and stamp it into broker_addr. Thin
 * wrapper over resolve_ipv4_hostname() — keeps the state-machine
 * caller simple. */
static int resolve_broker(void)
{
    otIp6Address addr;
    int rc = resolve_ipv4_hostname(MQTT_BROKER_HOSTNAME, &addr);
    if (rc != 0) {
        return rc;
    }
    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;
    memset(sin6, 0, sizeof(*sin6));
    sin6->sin6_family = AF_INET6;
    sin6->sin6_port = htons(MQTT_BROKER_PORT);
    memcpy(&sin6->sin6_addr, &addr, sizeof(addr));
    return 0;
}

