Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* MQTT Event Handler                                                          */
/* -------------------------------------------------------------------------- */

static uint32_t mqtt_connected_uptime_ms = 0;
static uint32_t mqtt_rx_count = 0;  /* MQTT messages received */
static uint32_t lora_rx_count = 0;  /* LoRa packets received */
static bool mqtt_first_connect = true; /* Clean session only on first connect */
static uint32_t doppler_interval_ms = 4000; /* Updated by foff [offset, tol, refresh] */
static uint32_t mqtt_last_pingresp_ms = 0;

/* Device MAC-based client ID — ESP32 format %04X%08X */
char device_client_id[13] = {0};

/* Forward declaration — defined later in RadioLib section */
/* Radio pointer type matches DTS compatible */
#if DT_NODE_HAS_COMPAT(DT_ALIAS(lora0), semtech_sx1262)
extern SX1262 *radio;
#elif DT_NODE_HAS_COMPAT(DT_ALIAS(lora0), semtech_sx1268)
extern SX1268 *radio;
#elif DT_NODE_HAS_COMPAT(DT_ALIAS(lora0), semtech_sx1276)
extern SX1276 *radio;
#elif DT_NODE_HAS_COMPAT(DT_ALIAS(lora0), semtech_sx1278)
extern SX1278 *radio;
#endif

static void mqtt_evt_handler(struct mqtt_client *client, const struct mqtt_evt *evt)
{
    uint32_t now = k_uptime_get_32();

    switch (evt->type) {
    case MQTT_EVT_CONNACK:
        if (evt->result == 0) {
            mqtt_connected_uptime_ms = now;
            watchdog_feed(); /* connection alive */
            LOG_INF("MQTT CONNECTED to %s:%d", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);

            {
                /* Station name for topics = cfg_station (dashboard-configured).
                 * MAC (device_client_id) is only for MQTT connect and the mac JSON field. */
                extern char device_client_id[13];

                tinygs_subscribe(client, cfg_mqtt_user, cfg_station);
                tinygs_send_welcome(client, cfg_mqtt_user, cfg_station,
                                    device_client_id);

                /* Web login URL: press BOOT button while display is active
                 * to publish tele/get_weblogin. Server responds on cmnd/weblogin
                 * with a one-time URL for configuring auto-tune etc. */
            }

            mqtt_first_connect = false; /* Next reconnect uses clean_session=0 */
            app_state = STATE_MQTT_CONNECTED;
        } else {
            LOG_ERR("MQTT CONNACK error: %d", evt->result);
            app_state = STATE_ERROR;
        }
        break;

    case MQTT_EVT_DISCONNECT:
        LOG_WRN("MQTT DISCONNECTED after %us: result=%d (%s)",
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000,
                evt->result, errno_name(evt->result));
        app_state = STATE_ERROR;
        break;

    case MQTT_EVT_PINGRESP:
        mqtt_last_pingresp_ms = now;
        watchdog_feed();
        LOG_INF("MQTT PINGRESP (connected %us)",
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;

    case MQTT_EVT_PUBLISH: {
        mqtt_rx_count++;
        watchdog_feed(); /* Any RX proves connection is alive */
        const struct mqtt_publish_param *pub = &evt->param.publish;
        static char rx_topic[128];
        /* Sized to match TINYGS_BEGINE_MAX_LEN — parser's stated ceiling.
         * Silent truncation here would hand invalid JSON to the parser. */
        static uint8_t rx_payload[TINYGS_BEGINE_MAX_LEN];
        uint32_t topic_len = MIN(pub->message.topic.topic.size, sizeof(rx_topic) - 1);
        memcpy(rx_topic, pub->message.topic.topic.utf8, topic_len);
        rx_topic[topic_len] = '\0';

        if (pub->message.payload.len >= sizeof(rx_payload)) {
            LOG_WRN("MQTT RX payload %u exceeds buffer %zu — will truncate",
                    (unsigned)pub->message.payload.len, sizeof(rx_payload));
        }
        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d (%s)", ret, errno_name(ret));
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        /* Truncate long payloads for logging — full payload is still parsed */
        if (ret > 0) {
            char saved = 0;
            if (ret > 200) { saved = rx_payload[200]; rx_payload[200] = '\0'; }
            LOG_INF("  payload: %s%s", (char *)rx_payload, ret > 200 ? "..." : "");
            if (saved) { rx_payload[200] = saved; }
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "beginp") == 0) {
                /* beginp = "persist as boot default, do NOT reconfigure live"
                 * (matches ESP32 MQTT_Client.cpp:669 setModemStartup).
                 * Server sends this to update the station's next-boot modem
                 * config; a follow-up `begine` handles the live tune. */
                size_t n = strlen((char *)rx_payload);
                if (n >= sizeof(tinygs_radio.modem_conf)) {
                    LOG_WRN("  → beginp: payload %zu > modem_conf buf, skipped", n);
                } else {
                    /* Validate we can at least deserialize it before saving —
                     * no point persisting a blob we couldn't load. */
                    struct tinygs_begine_msg tmp;
                    int64_t rc = tinygs_parse_begine((char *)rx_payload, ret, &tmp);
                    if (rc < 0 || !tmp.mode) {
                        LOG_WRN("  → beginp: invalid config, not persisting");
                    } else {
                        tinygs_config_save_modem_conf((char *)rx_payload);
                        LOG_INF("  → beginp: modem_conf persisted (%zu bytes)", n);
                    }
                }
            } else if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0) {
                if (radio != nullptr) {
                    /* Disable RX interrupt before reconfiguring radio.
                     * Prevents race where a packet received on the old config
                     * gets processed with the new satellite's filter/metadata.
                     * ESP32 does the same: clearPacketReceivedAction() + disableInterrupt() */
                    radio->clearPacketReceivedAction();

                    /* Drain any pending packet before reconfig */
                    if (lora_packet_received) {
                        lora_packet_received = false;
                    }

                    /* Store raw payload as modem_conf before parsing
                     * (json_obj_parse modifies the buffer in-place) */
                    size_t conf_len = strlen((char *)rx_payload);
                    if (conf_len < sizeof(tinygs_radio.modem_conf)) {
                        memcpy(tinygs_radio.modem_conf, rx_payload, conf_len + 1);
                    } else {
                        LOG_WRN("modem_conf too large (%zu > %zu), skipped",
                                conf_len, sizeof(tinygs_radio.modem_conf) - 1);
                    }

                    /* Parse begine JSON via Zephyr json.h descriptors */
                    struct tinygs_begine_msg msg;
                    int64_t parsed = tinygs_parse_begine((char *)rx_payload, ret, &msg);
                    if (parsed < 0) {
                        LOG_ERR("begine parse failed");
                    } else {
                        /* Common fields */
                        float freq = tinygs_begine_get_freq(&msg);
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                        }

