Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* MQTT-TLS Connection                                                         */
/* -------------------------------------------------------------------------- */

static int mqtt_tls_connect(void)
{
    LOG_INF("Connecting MQTT to [%s]:%d ...", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);

    mqtt_client_init(&mqtt_client);

    /* First connect: clean_session=1 (fresh subscriptions).
     * Reconnect after network drop: clean_session=0 (broker keeps
     * subscriptions and delivers queued messages). */
    mqtt_client.clean_session = mqtt_first_connect ? 1 : 0;

    mqtt_client.broker = &broker_addr;

    /* Populate device client ID if not done yet */
    if (device_client_id[0] == '\0') {
        uint64_t dev_id = NRF_FICR->DEVICEID[0] |
                          ((uint64_t)NRF_FICR->DEVICEID[1] << 32);
        snprintf(device_client_id, sizeof(device_client_id),
                 "%04X%08X", (uint16_t)(dev_id >> 32), (uint32_t)dev_id);
        LOG_INF("Device client ID: %s", device_client_id);
    }
    mqtt_client.client_id.utf8 = (uint8_t *)device_client_id;
    mqtt_client.client_id.size = strlen(device_client_id);

    static struct mqtt_utf8 username;
    username.utf8 = (uint8_t *)cfg_mqtt_user;
    username.size = strlen(cfg_mqtt_user);
    static struct mqtt_utf8 password;
    password.utf8 = (uint8_t *)cfg_mqtt_pass;
    password.size = strlen(cfg_mqtt_pass);
    mqtt_client.user_name = &username;
    mqtt_client.password = &password;

    /* Last Will Testament — tells server we disconnected */
    static char will_topic_str[128];
    snprintf(will_topic_str, sizeof(will_topic_str),
             TINYGS_TOPIC_STAT, cfg_mqtt_user, cfg_station, TINYGS_STAT_STATUS);
    static struct mqtt_topic will_topic = {
        .qos = MQTT_QOS_1_AT_LEAST_ONCE,
    };
    will_topic.topic.utf8 = (uint8_t *)will_topic_str;
    will_topic.topic.size = strlen(will_topic_str);
    static struct mqtt_utf8 will_msg = {
        .utf8 = (uint8_t *)"0",
        .size = 1,
    };
    mqtt_client.will_topic = &will_topic;
    mqtt_client.will_message = &will_msg;

    /* Buffers */
    mqtt_client.rx_buf = mqtt_rx_buf;
    mqtt_client.rx_buf_size = sizeof(mqtt_rx_buf);
    mqtt_client.tx_buf = mqtt_tx_buf;
    mqtt_client.tx_buf_size = sizeof(mqtt_tx_buf);

    /* Event handler */
    mqtt_client.evt_cb = mqtt_evt_handler;

    /* TLS direct to mqtt.tinygs.com via nat64.net public NAT64 */
    static sec_tag_t sec_tag_list[] = { MQTT_TLS_SEC_TAG };
    static bool cred_registered = false;

    if (!cred_registered) {
        int rc = tls_credential_add(MQTT_TLS_SEC_TAG,
                                     TLS_CREDENTIAL_CA_CERTIFICATE,
                                     tinygs_ca_cert,
                                     sizeof(tinygs_ca_cert));
        if (rc == 0 || rc == -EEXIST) {
            LOG_INF("TLS CA cert registered (sec_tag %d)", MQTT_TLS_SEC_TAG);
            cred_registered = true;
        } else {
            LOG_ERR("tls_credential_add failed: %d (%s)", rc, errno_name(rc));
        }
    }

    mqtt_client.transport.type = MQTT_TRANSPORT_SECURE;

    struct mqtt_sec_config *tls_cfg = &mqtt_client.transport.tls.config;
    tls_cfg->peer_verify = TLS_PEER_VERIFY_NONE;
    tls_cfg->cipher_list = NULL;
    tls_cfg->sec_tag_list = sec_tag_list;
    tls_cfg->sec_tag_count = ARRAY_SIZE(sec_tag_list);
    tls_cfg->hostname = MQTT_BROKER_HOSTNAME;
    tls_cfg->session_cache = TLS_SESSION_CACHE_ENABLED;

    LOG_INF("Connecting with TLS...");

    /* Enable mbedTLS debug output (level 2 = state changes + info) */
    int dbg_level = 2;
    /* Note: this gets applied after socket creation, inside mqtt_connect */

    int ret = mqtt_connect(&mqtt_client);
    if (ret != 0) {
        LOG_ERR("mqtt_connect() failed: %d (%s, errno=%d/%s)",
                ret, errno_name(ret), errno, errno_name(errno));
        return ret;
    }

    LOG_INF("mqtt_connect() returned OK, waiting for CONNACK...");
    return 0;
}

/* -------------------------------------------------------------------------- */
/* USB MSC & FATFS                                                             */
/* -------------------------------------------------------------------------- */

static FATFS fat_fs;
static struct fs_mount_t mp = {
    .type = FS_FATFS,
    .mnt_point = "/NAND:",
    .fs_data = &fat_fs,
    /* flags = 0 (no FS_MOUNT_FLAG_NO_FORMAT). With Zephyr's default
     * CONFIG_FS_FATFS_MOUNT_MKFS=y, fs_mount() will auto-format the
     * partition if it can't find a valid FAT boot sector — opt-out, not
     * opt-in. Don't change unless you mean to disable auto-format. */
};

/* Re-mount FATFS, read config.json, compare against the last snapshot we
 * persisted (cfg_last_snapshot). Returns true if the file content differs
 * — caller should reboot so the boot-time snapshot-diff applies the edits.
 *
 * Cases:
 *   - file exists, content == snapshot: no edit, return false (no reboot).
 *   - file exists, content != snapshot: user edit, return true (reboot).
 *   - file missing entirely (host nuked it): return true (reboot — boot
 *     path will re-create the file from current NVS state).
 *   - mount/read failure: return false (don't reboot on uncertainty —
 *     a failed mount could mean USB MSC hasn't fully released the volume,
 *     and the next VBUS toggle will retry). */
static bool usb_detach_config_changed(void)
{
    if (fs_mount(&mp) != 0) {
        return false;
    }

    static char buf[TINYGS_CONFIG_SNAPSHOT_MAX];
    struct fs_file_t f;
    fs_file_t_init(&f);
    bool no_file = (fs_open(&f, "/NAND:/config.json", FS_O_READ) != 0);
    ssize_t n = -1;
    if (!no_file) {
        n = fs_read(&f, buf, sizeof(buf) - 1);
        fs_close(&f);
    }
    fs_unmount(&mp);

    if (no_file) {
        return true;   /* file was deleted — reboot, boot path will recreate */
    }
    if (n <= 0) {
        return false;  /* read error — don't gamble on a reboot */
    }
    buf[n] = '\0';
    return strcmp(buf, cfg_last_snapshot) != 0;
}

static const char *html_content =
    "<!DOCTYPE html><html><head><title>TinyGS Configurator</title>"
    "<style>body{font-family:sans-serif;max-width:600px;margin:40px auto;padding:20px;background:#f4f4f9;}"
    ".card{background:white;padding:20px;border-radius:8px;box-shadow:0 2px 4px rgba(0,0,0,0.1);}"
    "input{width:100%;padding:8px;margin:8px 0;box-sizing:border-box;border:1px solid #ccc;border-radius:4px;}"
    ".row{display:flex;gap:8px;} .row input{flex:1;}"
    "button{background:#5a67d8;color:white;border:none;padding:10px 20px;border-radius:4px;cursor:pointer;width:100%;font-size:16px;}"
    "button:hover{background:#434190;}</style>"
    "</head><body>"
    "<div class='card'>"
    "<h1>TinyGS nRF52 Setup</h1>"
    "<p>Configure your Ground Station. Save config.json to this drive, then reboot.</p>"
    "<hr>"
    "<label>Station Name:</label><input type='text' id='station' placeholder='my_station_name'>"
    "<label>MQTT Username:</label><input type='text' id='user' placeholder='From TinyGS dashboard'>"
    "<label>MQTT Password:</label><input type='password' id='pass' placeholder='From TinyGS dashboard'>"
    "<br>"
    "<label>Station Location (required for satellite assignment):</label>"
    "<div class='row'>"
    "<input type='number' step='0.0001' id='lat' placeholder='Latitude (-33.8688)'>"
    "<input type='number' step='0.0001' id='lon' placeholder='Longitude (151.2093)'>"
    "<input type='number' step='1' id='alt' placeholder='Alt (m)'>"
    "</div>"
    "<br>"
    "<button onclick='saveConfig()'>Save config.json</button>"
    "<p style='font-size:0.8em;color:#666;'>Location must be set here &mdash; the TinyGS website cannot change it.</p>"
    "</div>"
    "<script>"
    "function saveConfig() {"
    "  const config = {"
    "    station: document.getElementById('station').value,"
    "    mqtt_user: document.getElementById('user').value,"
    "    mqtt_pass: document.getElementById('pass').value,"
    "    lat: parseFloat(document.getElementById('lat').value),"
    "    lon: parseFloat(document.getElementById('lon').value),"
    "    alt: parseFloat(document.getElementById('alt').value) || 0"
    "  };"
    "  const blob = new Blob([JSON.stringify(config, null, 2)], { type: 'application/json' });"
    "  const a = document.createElement('a');"
    "  a.href = URL.createObjectURL(blob);"
    "  a.download = 'config.json';"
    "  a.click();"
    "}"
    "</script>";
/* Closing tags added after commissioning info block */

/* Early-boot log capture.
 *
 * LOG_INF lines that fire BEFORE the USB CDC ACM host opens /dev/ttyACM0
 * (i.e. before DTR-assert) are silently dropped at the UART backend layer:
 * the driver returns an error when it has no host listener, and
 * log_backend_uart discards. Bumping CONFIG_LOG_BUFFER_SIZE doesn't help —
 * it's not a buffer-overflow problem.
 *
 * Workaround: setup_usb_storage and the boot-time usb_enable() use
 * EARLY_LOG instead of LOG_INF. EARLY_LOG appends to a static buffer.
 * After main() finishes the DTR-wait loop, early_log_dump() iterates the
 * buffer and re-emits each line via LOG_INF — by which time the host has
 * the port open, so the lines actually reach the console. Costs ~1 KB
 * static BSS for buffered lines; well inside our RAM headroom.
 */
#define EARLY_LOG_BUF_SIZE 1024
static char early_log_buf[EARLY_LOG_BUF_SIZE];
static size_t early_log_pos = 0;
static bool   early_log_active = true;

