Bwooce/tinygs_nRF52/src/main.cpp
            fs_file_t_init(&file);
            if (fs_open(&file, "/NAND:/index.html", FS_O_CREATE | FS_O_WRITE) == 0) {
                /* Write static HTML head */
                fs_write(&file, html_content, strlen(html_content));

                /* Append commissioning info */
                static char commission_html[256];
                int clen = snprintf(commission_html, sizeof(commission_html),
                    "<div class='card' style='margin-top:16px;'>"
                    "<h2>Thread Commissioning</h2>"
                    "<p><strong>MAC / EUI-64:</strong> %s</p>"
                    "<p><strong>Joiner PSKd:</strong> %s</p>"
                    "<p style='font-size:0.8em;color:#666;'>"
                    "Run on your OTBR: <code>ot-ctl commissioner joiner add '*' %s</code></p>"
                    "</div></body></html>",
                    device_client_id,
                    CONFIG_OPENTHREAD_JOINER_PSKD,
                    CONFIG_OPENTHREAD_JOINER_PSKD);
                fs_write(&file, commission_html, clen);
                fs_sync(&file);
                fs_close(&file);
            }
        }

        /* Config.json sync — NVS-authoritative, with user-edit detection
         * via snapshot diff:
         *
         *   NVS is the source of truth. cfg_last_snapshot (also in NVS)
         *   holds an exact copy of the last config.json the device wrote.
         *   On boot we compare the file content against the snapshot:
         *     - Match → no user edit since last write → ignore file,
         *       regenerate it from current memory (which is NVS-loaded).
         *     - Differ on a particular field → user edited that field
         *       since last boot → push new value to memory + NVS.
         *
         *   This is the only way to distinguish a user edit from a
         *   stale-file-vs-server-updated-NVS state, because both
         *   produce file ≠ memory.
         *
         *   Then we always rewrite config.json from current memory and
         *   save the new snapshot, so the next boot has a fresh
         *   reference for diffing.
         */
        {
            static char file_buf[TINYGS_CONFIG_SNAPSHOT_MAX];
            struct fs_file_t cfg;
            ssize_t file_n = -1;

            /* Read current config.json into file_buf (may not exist on
             * a freshly-formatted partition — that's fine, we'll just
             * skip the diff and write defaults). */
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_READ) == 0) {
                file_n = fs_read(&cfg, file_buf, sizeof(file_buf) - 1);
                fs_close(&cfg);
                if (file_n > 0) {
                    file_buf[file_n] = '\0';
                    EARLY_LOG("Config: read config.json (%d bytes)", (int)file_n);
                } else {
                    file_n = -1;
                }
            }

            /* For each field: parse the value from BOTH file and snapshot.
             * If they differ → user edit on that field → apply to memory
             * and persist to NVS. snapshot empty (first boot or after
             * NVS wipe) means we can't tell user edits from defaults; in
             * that case treat file values as authoritative for first-time
             * setup, but only when they look reasonable. */
            bool have_snapshot = (cfg_last_snapshot[0] != '\0');
            bool have_file = (file_n > 0);
            int edits = 0;

            #define DIFF_AND_APPLY_FLOAT(key, mem_var, range_lo, range_hi, save_call) do { \
                if (have_file) {                                                            \
                    float fv = json_extract_float(file_buf, key, -9999.0f);                \
                    float sv = have_snapshot ?                                              \
                        json_extract_float(cfg_last_snapshot, key, -9999.0f) :             \
                        -9999.0f;                                                           \
                    float dv = fv - sv;                                                    \
                    if (dv < 0) dv = -dv;                                                   \
                    bool edited = have_snapshot ? (dv > 0.0001f)                            \
                                                 : (fv != -9999.0f);                       \
                    if (edited && fv >= (range_lo) && fv <= (range_hi)) {                  \
                        EARLY_LOG("Config: user edit '%s' %.4f -> %.4f, persisting",       \
                                key, (double)(mem_var), (double)fv);                       \
                        (mem_var) = fv;                                                    \
                        save_call;                                                          \
                        edits++;                                                            \
                    }                                                                       \
                }                                                                           \
            } while (0)

            #define DIFF_AND_APPLY_STR(key, mem_var, save_call) do {                       \
                if (have_file) {                                                            \
                    char fv[sizeof(mem_var)] = "";                                          \
                    char sv[sizeof(mem_var)] = "";                                          \
                    int fv_found = json_extract_string(file_buf, key, fv, sizeof(fv));     \
                    if (have_snapshot) {                                                    \
                        json_extract_string(cfg_last_snapshot, key, sv, sizeof(sv));       \
                    }                                                                       \
                    /* Treat key-missing-from-file as "user did not touch this field"      \
                     * — never wipe a stored value because the file got truncated or       \
                     * the user removed the line. fv_found < 0 means strstr missed. */    \
                    bool edited = (fv_found >= 0) &&                                        \
                                  (have_snapshot ? (strcmp(fv, sv) != 0)                   \
                                                 : (fv[0] != '\0'));                        \
                    if (edited) {                                                           \
                        EARLY_LOG("Config: user edit '%s' '%s' -> '%s', persisting",       \
                                key, (mem_var), fv);                                       \
                        strncpy((mem_var), fv, sizeof(mem_var) - 1);                       \
                        (mem_var)[sizeof(mem_var) - 1] = '\0';                             \
                        save_call;                                                          \
                        edits++;                                                            \
                    }                                                                       \
                }                                                                           \
            } while (0)

            DIFF_AND_APPLY_FLOAT("\"lat\":", tinygs_station_lat, -90.0f, 90.0f,
                tinygs_config_save_location(tinygs_station_lat,
                                            tinygs_station_lon,
                                            tinygs_station_alt));
            DIFF_AND_APPLY_FLOAT("\"lon\":", tinygs_station_lon, -180.0f, 180.0f,
                tinygs_config_save_location(tinygs_station_lat,
                                            tinygs_station_lon,
                                            tinygs_station_alt));
            DIFF_AND_APPLY_FLOAT("\"alt\":", tinygs_station_alt, -500.0f, 9000.0f,
                tinygs_config_save_location(tinygs_station_lat,
                                            tinygs_station_lon,
                                            tinygs_station_alt));

