Bwooce/tinygs_nRF52/src/main.cpp
/* Cross-reboot continuity. __noinit RAM survives SREQ/DOG resets but not
 * POR/Pin/BOR. We periodically save the current epoch_ms so a warm reboot
 * can restore "good enough" time before SNTP completes — useful for log
 * timestamps and welcome-payload `time` field on quick reconnects. The
 * worst-case drift is the save interval plus boot overhead (~60–70 s). */
#define EPOCH_PERSIST_MAGIC  0x54494D58u  /* "TIMX" */
#define EPOCH_PERSIST_INTERVAL K_SECONDS(60)
/* Use the same pattern as crash_pc/crash_lr above: separate volatile scalars
 * with __noinit. C++ + LTO drops the section attribute when applied to an
 * aggregate, leaving the variable in BSS where it gets zeroed every boot.
 * Volatile scalars matching the working crash-diagnostic pattern survive. */
static volatile uint32_t __noinit epoch_persist_magic;
static volatile uint32_t __noinit epoch_persist_unix_ms_lo;
static volatile uint32_t __noinit epoch_persist_unix_ms_hi;

static void epoch_persist_save(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(epoch_persist_work, epoch_persist_save);

static void epoch_persist_save(struct k_work *work)
{
    ARG_UNUSED(work);
    if (time_synced) {
        int64_t now_ms = k_uptime_get() + sntp_epoch_offset_ms;
        epoch_persist_unix_ms_lo = (uint32_t)(now_ms & 0xFFFFFFFFu);
        epoch_persist_unix_ms_hi = (uint32_t)((uint64_t)now_ms >> 32);
        epoch_persist_magic      = EPOCH_PERSIST_MAGIC;
    }
    k_work_reschedule(&epoch_persist_work, EPOCH_PERSIST_INTERVAL);
}

/* Called from main() right after boot diagnostics, before networking.
 * If __noinit retains a valid epoch from a recent session, restore it so
 * get_utc_epoch_*() returns a sensible value before SNTP succeeds. */
static void epoch_persist_restore(void)
{
    if (epoch_persist_magic == EPOCH_PERSIST_MAGIC) {
        int64_t saved = (int64_t)(((uint64_t)epoch_persist_unix_ms_hi << 32) |
                                   (uint64_t)epoch_persist_unix_ms_lo);
        if (saved > 0) {
            sntp_epoch_offset_ms = saved - k_uptime_get();
            time_synced = true;
            LOG_INF("Time: restored from __noinit, epoch_ms=%lld", (long long)saved);
        } else {
            LOG_INF("Time: stored epoch invalid (saved=%lld)", (long long)saved);
        }
    } else {
        LOG_INF("Time: no stored epoch (magic=0x%08x)", (unsigned)epoch_persist_magic);
    }
    k_work_schedule(&epoch_persist_work, EPOCH_PERSIST_INTERVAL);
}

/* Signalled by sntp_response_handler so sntp_sync() can block the state
 * machine until we have a real epoch (or a hard timeout). Welcome payload
 * carries the `time` field, so we must sync *before* CONNACK. */
static K_SEM_DEFINE(sntp_sem, 0, 1);

int64_t get_utc_epoch_us(void)
{
    if (!time_synced) return 0;
    return (k_uptime_get() + sntp_epoch_offset_ms) * 1000LL;
}

int64_t get_utc_epoch(void)
{
    if (!time_synced) return 0;
    return (k_uptime_get() + sntp_epoch_offset_ms) / 1000LL;
}

/* SNTP callback — called from OpenThread context */
static void sntp_response_handler(void *aContext, uint64_t aTime, otError aResult)
{
    if (aResult == OT_ERROR_NONE) {
        sntp_epoch_offset_ms = (int64_t)aTime * 1000LL - k_uptime_get();
        time_synced = true;
        sntp_done_this_boot = true;
        LOG_INF("SNTP: synced, epoch=%llu", (unsigned long long)aTime);
    } else {
        LOG_WRN("SNTP: failed (%d %s)", (int)aResult, otThreadErrorToString(aResult));
    }
    k_sem_give(&sntp_sem);
}

/**
 * Sync time via OpenThread SNTP client.
 * Uses Google NTP (2001:4860:4806:8::) — native IPv6, no NAT64 needed.
 */
static void sntp_sync(void)
{
    struct openthread_context *ot_ctx = openthread_get_default_context();
    if (!ot_ctx) return;

    /* Resolve TINYGS_SNTP_HOSTNAME through the same DNS path the MQTT
     * client uses. The resolver returns a NAT64-synthesised AAAA for the
     * IPv4 NTP server the pool picks today — so no hardcoded IPv4 to go
     * stale, and no extra failure mode (if DNS is broken, MQTT is broken
     * too and the station is already down). Cached statically: resolve
     * on first use, reuse for subsequent re-syncs. */
    static otIp6Address sntp_peer_addr;
    static bool sntp_peer_resolved = false;
    if (!sntp_peer_resolved) {
        if (resolve_ipv4_hostname(TINYGS_SNTP_HOSTNAME, &sntp_peer_addr) != 0) {
            LOG_WRN("SNTP: hostname resolution failed, skipping sync");
            return;
        }
        sntp_peer_resolved = true;
    }

    otMessageInfo msgInfo;
    memset(&msgInfo, 0, sizeof(msgInfo));
    msgInfo.mPeerAddr = sntp_peer_addr;
    msgInfo.mPeerPort = TINYGS_SNTP_SERVER_PORT;

    char sntp_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&msgInfo.mPeerAddr, sntp_str, sizeof(sntp_str));
    LOG_INF("SNTP: query to %s [%s]:%u",
            TINYGS_SNTP_HOSTNAME, sntp_str, (unsigned)msgInfo.mPeerPort);

    otSntpQuery query;
    query.mMessageInfo = &msgInfo;

    k_sem_reset(&sntp_sem);

    openthread_api_mutex_lock(ot_ctx);
    otError err = otSntpClientQuery(openthread_get_default_instance(), &query,
                                     sntp_response_handler, NULL);
    openthread_api_mutex_unlock(ot_ctx);

    if (err != OT_ERROR_NONE) {
        LOG_WRN("SNTP: query failed (%d %s)", (int)err, otThreadErrorToString(err));
        return;
    }

    /* Block the state machine until the callback fires or we hit the
     * timeout. Non-fatal on timeout: welcome still gets sent, just with
     * time=0. Server tolerates missing/zero time (it's an optional field). */
    if (k_sem_take(&sntp_sem, K_SECONDS(10)) != 0) {
        LOG_WRN("SNTP: response timeout, proceeding without synced time");
    }
}

/* Daily drift-correction. nRF52840 RC RTC is ~250 ppm = ~22 s/day, which
 * would visibly drift a stable connect over a few days. Runs on the system
 * workq so the 10 s blocking sntp_sync() doesn't stall the MQTT main loop.
 * Doesn't clear time_synced — old offset stays valid until the callback
 * atomically replaces it, so a failed periodic resync doesn't break the
 * station. Reschedules unconditionally: next attempt is always 24 h away. */
#define SNTP_RESYNC_INTERVAL  K_HOURS(24)
static void sntp_resync_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(sntp_resync_work, sntp_resync_work_handler);

